"use strict";

// new RegExp('pattern', 'flags');  // старий спосіб
// /pattern/flags                   // новий спосіб

const ans = prompt('Введіть ваше число');

const reg = /\d/g; 
//!  test - метод рег.вир, шукає та повертає true, false
console.log(reg.test(ans));


const str = 'My name is R2D2';           // вирізаєм R2D2
console.log(str.match(/\w\d\w\d/ig));    // патерн-шаблон = буква-цифра, бувквм-цифра
console.log(str.match(/\D/ig));          // виводим НЕ цифри в масив 

// console.log(ans.match(reg));            // Виведем тільки цифри

//? flags
// i    = шукаєм щось незалежно від регістру
// g    = global, шукаєм одразу декілька наявностей
// m    = включає багаторядковий режим

//? Класи патернів
// \d   = шукаєм цифри
// \w   = шукаєм усі букви, цифри
// \s   = шукаєм пробіли

//? Класи патернів Зворотні
// \D   = шукаєм НЕ цифри

// \W   = шукаєм усі НЕ слова, букви
// \S   = шукаєм НЕ пробіли

//! --методи для строк--

//! .search - Шукає тільки 1 співпадіння
// console.log(ans.search(reg));    
//! .match - метод, отримуєм масив з усіма співпадіннями
// console.log(ans.match(reg));    

// const pass = prompt('Password?');

//! .replace - метод заміни, має 2 аргумента: 1 що заміняєм, 2 на що заміняєм
console.log(pass.replace(/./g, '*'));
console.log(pass.match(/\d/ig));
console.log('12-34-56'.replace(/-/g, ':'));    //? заміна - на :
// '.' означає пошук всього як *
// '\' екран, вкузує що йде не спец-символ а просто крапка, наприклад



